{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-LOCATION",
    "4": "I-LOCATION",
    "5": "B-DATE",
    "6": "I-DATE",
    "7": "B-PHONE",
    "8": "I-PHONE",
    "9": "B-SSN",
    "10": "I-SSN",
    "11": "B-ORG",
    "12": "I-ORG",
    "13": "B-EMAIL",
    "14": "I-EMAIL"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DATE": 5,
    "B-EMAIL": 13,
    "B-LOCATION": 3,
    "B-ORG": 11,
    "B-PERSON": 1,
    "B-PHONE": 7,
    "B-SSN": 9,
    "I-DATE": 6,
    "I-EMAIL": 14,
    "I-LOCATION": 4,
    "I-ORG": 12,
    "I-PERSON": 2,
    "I-PHONE": 8,
    "I-SSN": 10,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "use_cache": false,
  "vocab_size": 30522
}
